tap "felixkratz/formulae"             # borders
tap "nikitabobko/tap"                 # Aerospace

brew "cliclick"                       # Mouse/keyboard emulation for macos
brew "pinentry-mac"                   # Alternative pinentry that works on mac
brew "reattach-to-user-namespace"     # Pasteboard fix for tmux in macos
brew "trash", link: true              # Recoverable `rm` for macos
brew "felixkratz/formulae/borders"    # Customizable window borders for macos
brew "felixkratz/formulae/sketchybar" # Customizable menu bar for macos

cask "aerospace"                      # i3-like tiling window manager for macos
cask "alfred"                         # App launcher for macos
cask "bitwarden"                      # Password manager
cask "cloudflare-warp"                # DNS resolver for speed & better privacy
cask "discord"                        # IM for communities
cask "firefox"                        # Still best in spite of privacy concerns
cask "homerow"                        # Vimium-esque navigation, but everywhere
cask "imageoptim"                     # GUI to bulk convert image formats
cask "karabiner-elements"             # Low-effort keyboard customizer
cask "libreoffice"                    # Office suite for poor people
cask "little-snitch"                  # Proprietary network monitor
cask "ngrok"                          # Runs local ports to public URLs
cask "private-internet-access"        # VPN
cask "rar"                            # RAR unpacker
cask "rectangle"                      # Spare window manager, more basic
cask "skim"                           # PDF reader for macos
cask "spotify"                        # Music streaming service
cask "steam"                          # Gaming platform service
cask "tailscale-app"                  # Free VPN service for my home server
cask "thunderbird"                    # Mozilla's e-mail client
cask "vlc"                            # The MVP open source media player
cask "wezterm"                        # Terminal emulator and multiplexer
cask "whatsapp"                       # Because my family keeps using it
cask "qutebrowser"                    # Keyboard-driven web browser
